aaron-bond.better-comments
adpyke.vscode-sql-formatter
alefragnani.project-manager
anthropic.claude-code
be5invis.toml
bierner.markdown-mermaid
bradlc.vscode-tailwindcss
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
eamodio.gitlens
esbenp.prettier-vscode
github.github-vscode-theme
github.vscode-github-actions
golang.go
graphql.vscode-graphql
graphql.vscode-graphql-syntax
hashicorp.terraform
jebbs.plantuml
kaiwood.endwise
mechatroner.rainbow-csv
mhutchie.git-graph
mosapride.zenkaku
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-ceintl.vscode-language-pack-ja
ms-vscode-remote.remote-containers
ms-vscode.makefile-tools
oderwat.indent-rainbow
pkief.material-icon-theme
qhoekman.language-plantuml
rebornix.ruby
redhat.vscode-yaml
shardulm94.trailing-spaces
shopify.ruby-lsp
tyriar.sort-lines
unional.vscode-sort-package-json
well-ar.plantuml
wingrunr21.vscode-ruby
xdebug.php-debug
yzhang.markdown-all-in-one
