aaron-bond.better-comments
adpyke.vscode-sql-formatter
alefragnani.project-manager
be5invis.toml
bierner.markdown-mermaid
bradlc.vscode-tailwindcss
christian-kohler.path-intellisense
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
dotjoshjohnson.xml
eamodio.gitlens
esbenp.prettier-vscode
flowtype.flow-for-vscode
gcazaciuc.vscode-flow-ide
github.github-vscode-theme
golang.go
graphql.vscode-graphql
graphql.vscode-graphql-syntax
hashicorp.terraform
jebbs.plantuml
kaiwood.endwise
mechatroner.rainbow-csv
mekusuri.jsonl-tool
mhutchie.git-graph
misogi.ruby-rubocop
mosapride.zenkaku
ms-azuretools.vscode-docker
ms-ceintl.vscode-language-pack-ja
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.makefile-tools
ms-vscode.remote-explorer
ms-vscode.remote-server
oderwat.indent-rainbow
pkief.material-icon-theme
qhoekman.language-plantuml
rebornix.ruby
redhat.vscode-yaml
shardulm94.trailing-spaces
tyriar.sort-lines
unional.vscode-sort-package-json
well-ar.plantuml
wingrunr21.vscode-ruby
xdebug.php-debug
yzhang.markdown-all-in-one
