# --------------------
# Mac Tools
# --------------------
# Browser
cask "brave-browser"
cask "google-chrome"
cask "microsoft-edge"

# IME
cask "google-japanese-ime"

# Inbox
cask "raycast"
cask "deepl"
cask "appcleaner"
cask "iina"
cask "notunes"
cask "linearmouse"

# --------------------
# Dev Tools
# --------------------
# Ruby
brew "icu4c"
brew "libyaml"
brew "openssl@3"
brew "openssl@1.1"
brew "rbenv"
brew "readline"
brew "ruby-build"

# Node.js
brew "nodenv"
brew "node-build"
brew "node"
brew "yarn"
brew "npm"

# Python
brew "pyenv"

# Java
brew "openjdk"

# Go
brew "goenv"

# Editor
cask "visual-studio-code"
cask "cursor"
brew "nvim"

# Terminal
cask "iterm2"
cask "warp"

# API Client
cask "postman"

# DB Client
cask "dbeaver-community"

# DB
brew "mysql"
brew "postgresql@14"
brew "sqlite"

# VPN
brew "tailscale"

# Font
cask 'font-hackgen'
cask 'font-hackgen-nerd'

# AWS
brew "awscli"

# GCP
cask "gcloud-cli"

# Scrcpy
brew "scrcpy"
cask "android-platform-tools"

# Fastly
tap "fastly/tap"
brew "fastly/tap/fastly"

# terraform
brew "tfenv"

# Testing
brew "jmeter"

# Command line tools
brew "direnv"
brew "jq"
brew "yq"
brew "mas"
brew "telnet"
brew "yamllint"
brew "tree"
brew "wget"
brew "just"

# AI Agents
brew "rulesync"
cask "codex"
cask "claude-code"

# Message
cask "slack"
cask "discord"

# Inbox
brew "gcc"
brew "guile"
brew "gnupg"
brew "gnutls"
brew "gmp"
brew "graphviz"
brew "coreutils"
brew "redis"
brew "ansible"
brew "gh"
